app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures" WHERE (created_at < '2013-12-31 20:26:31.828480')
---
   def index
     @pictures = Picture.all

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "6"]]
---
   def show
     @picture = Picture.find(params[:id])

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @picture = Picture.find(params[:id])

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "pictures" SET "artist" = ?, "title" = ?, "updated_at" = ? WHERE "pictures"."id" = 12  [["artist", "Michelangelo"], ["title", "Creation of Adam"], ["updated_at", Fri, 31 Jan 2014 20:04:32 UTC +00:00]]
---
  def update
    @picture = Picture.find(params[:id])

    if @picture.update_attributes(picture_params)

INSERT INTO "pictures" ("artist", "created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["artist", "lol"], ["created_at", Mon, 27 Jan 2014 20:04:45 UTC +00:00], ["title", "lol"], ["updated_at", Mon, 27 Jan 2014 20:04:45 UTC +00:00], ["url", "lol"]]
---
  def create
    # make a new picture with what picture_params returns (which is a method we're calling)
    @picture = Picture.new(picture_params)
    if @picture.save

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 1]]
---
  def destroy
    @picture = Picture.find(params[:id])
    @picture.destroy